#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda_package: Reading...
data.archive_file.lambda_stop_package: Reading...
data.archive_file.lambda_package: Read complete after 0s [id=add2660100fde94410d1c552100036a8eae36446]
data.archive_file.lambda_stop_package: Read complete after 0s [id=7e10e15c20bde92cb0950226c51efcdc7865c8e5]
aws_api_gateway_rest_api.stop_ec2_gateway: Refreshing state... [id=1k9ub8vhk6]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY]
aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/lambda_policy]
aws_iam_policy.cloudwatch_logs_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/cloudwatch_logs_policy]
aws_api_gateway_rest_api.transcription_gateway: Refreshing state... [id=hzjgd3yz9g]
aws_iam_policy.secrets_manager_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/secrets_manager_policy]
aws_iam_role.lambda_role: Refreshing state... [id=lambda-role]
aws_iam_user.nextjs_user: Refreshing state... [id=nextjs-access-user]
aws_iam_role.access_s3_and_logs: Refreshing state... [id=access_s3_and_logs_role]
aws_s3_bucket.transcript-bucket: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_iam_policy.stop_lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/stop_lambda_policy]
aws_security_group.allow_all: Refreshing state... [id=sg-066a59bd2a442570c]
aws_iam_group.nextjs_access_group: Refreshing state... [id=nextjs-access-group]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=lambda-role-20231209192723088800000001]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=lambda-role-20231209192723097600000002]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2_s3_and_logs_profile]
aws_lambda_function.stop_lambda: Refreshing state... [id=stopEC2Function]
aws_iam_role_policy_attachment.cloudwatch_logs_access: Refreshing state... [id=access_s3_and_logs_role-20250107192002115200000001]
aws_iam_role_policy_attachment.secrets_manager_access: Refreshing state... [id=access_s3_and_logs_role-20250106171900302500000003]
aws_iam_role_policy_attachment.s3_access: Refreshing state... [id=access_s3_and_logs_role-20250106171900258100000001]
aws_iam_group_policy_attachment.s3_access_attachment: Refreshing state... [id=nextjs-access-group-20250106183412668000000003]
aws_iam_group_policy_attachment.cloudwatch_access_attachment: Refreshing state... [id=nextjs-access-group-20250106183412653800000002]
aws_iam_user_group_membership.nextjs_user_membership: Refreshing state... [id=terraform-20250106183412629600000001]
aws_secretsmanager_secret_version.api_key_version: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY|terraform-20250106210759140500000001]
aws_api_gateway_resource.root: Refreshing state... [id=w3noxm]
aws_api_gateway_resource.stop_root: Refreshing state... [id=x1c8e2]
aws_api_gateway_method.stop_proxy: Refreshing state... [id=agm-1k9ub8vhk6-x1c8e2-GET]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_method.options: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-OPTIONS]
aws_instance.transcription_server: Refreshing state... [id=i-03e760b1638d03c4a]
aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_method_response.stop_proxy: Refreshing state... [id=agmr-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-OPTIONS]
aws_lambda_permission.stop_apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.stop_lambda_integration: Refreshing state... [id=agi-1k9ub8vhk6-x1c8e2-GET]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_api_gateway_deployment.stop_deployment: Refreshing state... [id=f3wqgu]
aws_api_gateway_integration_response.stop_proxy: Refreshing state... [id=agir-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_stage.stop_dev: Refreshing state... [id=ags-1k9ub8vhk6-dev]
aws_s3_bucket_policy.transcript-bucket-policy: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_s3_bucket_cors_configuration.transcript-bucket-cors: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_lambda_function.start_lambda: Refreshing state... [id=startTranscriptionFunction]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_deployment.deployment: Refreshing state... [id=ey4o6i]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.options_integration must be replaced
-/+ resource "aws_api_gateway_integration" "options_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "w3noxm" -> (known after apply)
      ~ id                      = "agi-hzjgd3yz9g-w3noxm-OPTIONS" -> (known after apply)
      + integration_http_method = "OPTIONS" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_instance.transcription_server must be replaced
-/+ resource "aws_instance" "transcription_server" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:117572128031:instance/i-03e760b1638d03c4a" -> (known after apply)
      ~ availability_zone                    = "eu-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-03e760b1638d03c4a" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "stopping" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0574dff233d2b8b4a" -> (known after apply)
      ~ private_dns                          = "ip-172-31-47-112.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.47.112" -> (known after apply)
      ~ public_dns                           = "ec2-3-127-231-107.eu-central-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.127.231.107" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "allow_all",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-07dd7962fcc0a015c" -> (known after apply)
        tags                                 = {
            "Name" = "Transcription Server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "700b23b68868029ad1ded4d24d63ba4457457853" -> "79d2afd0bded38da02420ecc0c9d8ec82e8251f1" # forces replacement
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 2 -> (known after apply)
          ~ threads_per_core = 2 -> (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-01252c4f022813eaf" -> (known after apply)
          ~ volume_size           = 45 -> (known after apply)
          ~ volume_type           = "gp3" -> (known after apply)
        }
    }

  # aws_lambda_function.start_lambda will be updated in-place
  ~ resource "aws_lambda_function" "start_lambda" {
        id                             = "startTranscriptionFunction"
        tags                           = {}
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "INSTANCE_ID" = "i-03e760b1638d03c4a"
              - "SECRET"      = "ewogICAgIkFQSV9VUkwiOiAiaHR0cHM6Ly93d3cudG9uLXRleHRlci5kZS9hcGkvdHJhbnNjcmlwdC9hbGwiLAogICAgIlRSQU5TQ1JJUFRJT05fU0VSVklDRV9BUElfS0VZIjogImNyejhlQktDNzljMlIzaHNmeUxRUlpIakszdk10YUJrbmZBWURqbU1MTHlETVlLWUVUIiwKICAgICJNT0RJRllfVVJMIjogImh0dHBzOi8vd3d3LnRvbi10ZXh0ZXIuZGUvYXBpL3RyYW5zY3JpcHQvIiwKICAgICJCVUNLRVRfTkFNRSI6ICJ0cmFuc2NyaXB0LWJ1Y2tldDIwMjMxMjA3MTgxMTEwNDcwMzAwMDAwMDAxIiwKICAgICJTRUNSRVRfS0VZIjogIlNrang1aHFrai9RdFN5TWlwZkVMRVh0T0sxU3lweStzUWxuZkNwUjEiLAogICAgIkFDQ0VTU19LRVkiOiAiQUtJQVJXWDZZSlVQVjJRSjZERlQiLAogICAgIkhVR19UT0tFTiI6ICJoZl9JWkZCaVh3ZVpGTXVsRU9DRmhKUWVyQ3JwZU9vVE1odGNBIiwKICAgICJTVE9QX1VSTCI6Imh0dHBzOi8vMWs5dWI4dmhrNi5leGVjdXRlLWFwaS5ldS1jZW50cmFsLTEuYW1hem9uYXdzLmNvbS9kZXYvc3RvcF9lYzIiCn0="
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ instance_id = "i-03e760b1638d03c4a" -> (known after apply)

Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ns144, Action: `pull_request`*